sdaiAdd(Sdai_Id_aggr*,SdaiPrimitiveType,BTEllipsis)
\details
Adds a new member to an unordered aggregate (set/bag) instance.
\param unorderedAggr [in] An aggregate instance to add a new member to.
\param valueType     [in] A data type of the new aggregate member value.
\remarks
You can specify more than one element value for the new aggregate by passing them to the function starting from the third parameter.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiVT_NVLD - Value type invalid.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiAI_NVLD - Aggregate instance invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance unitAssignment = sdaiCreateInstanceBN(model, "IfcUnitAssignment");
SdaiSet units = sdaiCreateAggrBN(unitAssignment, "Units");
SdaiADB adbIfcUnit = sdaiCreateEmptyADB();
SdaiString typePath[] = { "IfcNamedUnit" };
sdaiPutADBTypePath(adbIfcUnit, 1, typePath);
sdaiPutADBValue(adbIfcUnit, sdaiINSTANCE, appendSiUnit(model, "LENGTHUNIT", NULL, "METRE"));
sdaiAdd(units, sdaiADB, adbIfcUnit);